In [2]:
import pandas as pd

In [3]:
pwd

'D:\\Projects\\python practice\\ml and data science'

In [7]:
df = pd.read_csv('example')

In [13]:
df.to_csv('my_output',index = False)

In [14]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [15]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [24]:
df.isna()

       a      b      c      d
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False

In [25]:
import numpy as  np

In [28]:
df['a'][1]= np.nan

In [35]:
df.dropna(axis=0)

      a   b   c   d
0   0.0   1   2   3
2   8.0   9  10  11
3  12.0  13  14  15

In [36]:
np.eye(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])